### ETL para Exploración

In [2]:
import pandas as pd
import numpy as np

### Rubros

In [9]:
# Dirección archivo
URL = 'C:/Users/juan.vergara/OneDrive - Caren Repuestos Flotacentro/Documentos/Análisis/Segmentación Clientes/Fase 3 Recopilación de Datos/Extracción de Datos/'

In [10]:
# Carga de archivo eliminando la fila 0 (viene nulla)
df_2021 = pd.read_table(URL+'2021.txt', sep = ';', ).drop(0)
df_2020 = pd.read_table(URL+'2020.txt', sep = ';', ).drop(0)
df_2019 = pd.read_table(URL+'2019.txt', sep = ';', ).drop(0)

frames = [df_2021, df_2020, df_2019]

df = pd.concat(frames)

# Limpiando los datos '-' del campo fecha
df = df[df.Fecha != '-']

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (8,10,15,30,31,33,43,44,45) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (8,10,15,30,31,32,33,38,43,44,45) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [11]:
df.columns

Index(['Año', 'Mes', 'Fecha', 'Zona', 'CeCo', 'Sucursal', 'Vendedor',
       'Tipo Vendedor', 'N° Folio', 'TipoDocto', 'NotaVenta',
       'Segmento Cliente', 'Subsegmento', 'Rubro', 'RUT', 'NroCliente',
       'Cliente', 'Linea', 'Encargado', 'LineaN1', 'LineaN2', 'LineaN3',
       'LineaN4', 'ABCDZ', 'Marca', 'Grupo', 'Subgrupo', 'CodCaren',
       'Producto', 'Obsoleto', 'CodCondPago', 'Q', '$ Precio', '$ Costo',
       '$ Venta', '$ Margen', '% Margen', '% Dscto', '$ Descuento',
       '# Clientes', '# Ticket', '# SKU', '$ Ticket Prom.', '$ Venta Meta',
       '$ Margen Meta', 'Q UM'],
      dtype='object')

In [12]:
df.head(5)

,Año,Mes,Fecha,Zona,CeCo,Sucursal,Vendedor,Tipo Vendedor,N° Folio,TipoDocto,...,% Margen,% Dscto,$ Descuento,# Clientes,# Ticket,# SKU,$ Ticket Prom.,$ Venta Meta,$ Margen Meta,Q UM
1,2021.0,1.0,02-01-2021,Zona Austral,13.0,Puerto Montt,M7-Aguila Luis,Mesón,2354658.0,FV,...,56%,0%,0,1.0,1.0,1.0,$ 6.336,0,0,1
2,2021.0,1.0,02-01-2021,Zona Austral,13.0,Puerto Montt,M7-Aguila Luis,Mesón,2354658.0,FV,...,28%,0%,0,1.0,1.0,1.0,$ 73.932,0,0,38
3,2021.0,1.0,02-01-2021,Zona Austral,13.0,Puerto Montt,M7-Aguila Luis,Mesón,2354684.0,FV,...,53%,0%,0,1.0,1.0,1.0,$ 8.160,0,0,1
4,2021.0,1.0,02-01-2021,Zona Austral,13.0,Puerto Montt,M7-Aguila Luis,Mesón,2354712.0,FV,...,34%,15%,17.142,1.0,1.0,1.0,$ 97.135,0,0,1
5,2021.0,1.0,02-01-2021,Zona Austral,14.0,Osorno FC,67-Alvaro Cárdenas,Terreno,2354623.0,FV,...,100%,0%,0,1.0,1.0,1.0,$ 7.143,0,0,1

In [13]:
# Nos quedamos con los campos relevantes
df = df[['RUT','Rubro']]

In [14]:
df = df.drop_duplicates()

In [15]:
df.dtypes

RUT      object
Rubro    object
dtype: object

In [16]:
df.count()

RUT      84328
Rubro    84328
dtype: int64

In [17]:
df['Rut'] = df['RUT'].str.split('-').str[0]
df['Rut'] = df['Rut'].astype('int64')

df.head()

          RUT                    Rubro       Rut
1  76297447-9  Transporte De Pasajeros  76297447
3  76884768-1      Transporte De Carga  76884768
4  77276874-5          Sin Información  77276874
5  76718833-1      Transporte De Carga  76718833
7  76518049-K      Transporte De Carga  76518049

In [18]:
# RUT GRUPOS

df_rut = pd.read_excel(URL+'RUT_Grupos.xlsx')
df_rut.head()

        Rut                        grupo  Rut_Grupo
0   2275184            Transportes Camus    2275184
1  53333206            Transportes Camus    2275184
2   4457615   Meneses Ponce Hermo Efrain    4457615
3  79617470   Meneses Ponce Hermo Efrain    4457615
4   4684951  Rojas Pina Cesar Del Carmen    4684951

In [19]:
df_rut['Rut_Grupo'] = df_rut['Rut_Grupo'].astype(object)
df_rut.dtypes

Rut           int64
grupo        object
Rut_Grupo    object
dtype: object

In [20]:
# Left Join

df_fuc = pd.merge(df, df_rut, on ='Rut', how = 'left')

# If

df_fuc.loc[df_fuc['Rut_Grupo'].isnull(), 'RUT_v'] = df_fuc['Rut']
df_fuc.loc[df_fuc['Rut_Grupo'].notnull(), 'RUT_v'] = df_fuc['Rut_Grupo']

df_fuc.head()

          RUT                    Rubro       Rut grupo Rut_Grupo       RUT_v
0  76297447-9  Transporte De Pasajeros  76297447   NaN       NaN  76297447.0
1  76884768-1      Transporte De Carga  76884768   NaN       NaN  76884768.0
2  77276874-5          Sin Información  77276874   NaN       NaN  77276874.0
3  76718833-1      Transporte De Carga  76718833   NaN       NaN  76718833.0
4  76518049-K      Transporte De Carga  76518049   NaN       NaN  76518049.0

In [21]:
df_fuc = df_fuc.drop('RUT',1)
df_fuc = df_fuc.drop('Rut',1)
df_fuc = df_fuc.drop('grupo',1)
df_fuc = df_fuc.drop('Rut_Grupo',1)

In [22]:
df_fuc['RUT'] = df_fuc['RUT_v']
df_fuc = df_fuc.drop('RUT_v',1)

In [23]:
df_fuc.head()

                     Rubro         RUT
0  Transporte De Pasajeros  76297447.0
1      Transporte De Carga  76884768.0
2          Sin Información  77276874.0
3      Transporte De Carga  76718833.0
4      Transporte De Carga  76518049.0

In [24]:
# Borramos las filas duplicadas
df_fuc.drop_duplicates(subset=['RUT'])

                         Rubro         RUT
0      Transporte De Pasajeros  76297447.0
1          Transporte De Carga  76884768.0
2              Sin Información  77276874.0
3          Transporte De Carga  76718833.0
4          Transporte De Carga  76518049.0
...                        ...         ...
84323      Transporte De Carga  15951667.0
84324          Sin Información  11535762.0
84325        Faenas/Extraccion  76816580.0
84326          Sin Información  19122736.0
84327          Sin Información   9290603.0

[84037 rows x 2 columns]

In [25]:
df_fuc.head()

                     Rubro         RUT
0  Transporte De Pasajeros  76297447.0
1      Transporte De Carga  76884768.0
2          Sin Información  77276874.0
3      Transporte De Carga  76718833.0
4      Transporte De Carga  76518049.0

In [26]:
df_fuc.dtypes

Rubro    object
RUT      object
dtype: object

In [27]:
df_fuc.count()

Rubro    84328
RUT      84328
dtype: int64

In [28]:
df_fuc.to_csv('Rubro_Clientes.csv', index = False)